homecooked-rails/app/controllers/dinners_controller.rb

  def index
    puts "user: #{@current_user.json_hash[:id]}"
    hosted_dinners = []
    attended_dinners = []
    @hosted_dinners = @current_user.hosted_dinners.order(starts_at: :asc).each do |dinner|
      hosted_dinners << dinner.all_info
    end
    @attended_dinners = @current_user.attended_dinners.each do |dinner|
---
SELECT "dinners".* FROM "dinners" WHERE "dinners"."host_id" = $1 ORDER BY "dinners"."starts_at" DESC  [["host_id", 1]]
SELECT "dinners".* FROM "dinners" WHERE "dinners"."host_id" = $1  [["host_id", 1]]

  def index_hosting
    puts "user: #{@current_user.json_hash[:id]}"
    dinners = []
    @dinners = @current_user.hosted_dinners
    @dinners.each do |dinner|
---
SELECT "dinners".* FROM "dinners" WHERE "dinners"."host_id" = $1  [["host_id", 1]]

  def show
    puts "user: #{@current_user.json_hash[:id]}"
    @dinner = @current_user.hosted_dinners.find_by(id: params[:id])
---
SELECT  "dinners".* FROM "dinners" WHERE "dinners"."host_id" = $1 AND "dinners"."id" = $2 LIMIT $3  [["host_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @dinner = Dinner.new(dinner_params)
    @dinner.host_id = @current_user.json_hash[:id]
    if @dinner.valid?
      @dinner.save
---
INSERT INTO "dinners" ("starts_at", "location", "host_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["starts_at", "2017-11-17 19:30:00"], ["location", "My House"], ["host_id", 1], ["created_at", "2017-11-16 15:16:34.499373"], ["updated_at", "2017-11-16 15:16:34.499373"]]

  def update
    @dinner = Dinner.find(params[:id])
    @dinner.update(dinner_params)
---
SELECT  "dinners".* FROM "dinners" WHERE "dinners"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "dinners" SET "starts_at" = $1, "location" = $2, "updated_at" = $3 WHERE "dinners"."id" = $4  [["starts_at", "2017-11-17 19:30:00"], ["location", "My House"], ["updated_at", "2017-11-16 20:58:11.085423"], ["id", 3]]

  def invite
    @invite = Invite.new
    @invite.invited_id = params[:invited_id]
    @invite.dinner_id = params[:id]
    if @invite.valid?
      @invite.save
---
INSERT INTO "invites" ("invited_id", "dinner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["invited_id", 2], ["dinner_id", 2], ["created_at", "2017-11-16 17:10:03.831364"], ["updated_at", "2017-11-16 17:10:03.831364"]]

  def accept
    @invite = Invite.find_by(dinner_id: params[:id], invited_id: @current_user.json_hash[:id])
    if @invite
      @acceptance = AttendeeDinner.new
      @acceptance.dinner_id = @invite.dinner_id
      @acceptance.attendee_id = @invite.invited_id
      if @acceptance.valid?
        @acceptance.save
        @invite.delete
---
SELECT "invites".* FROM "invites" WHERE "invites"."dinner_id" = $1 AND "invites"."invited_id" = $2  [["dinner_id", 2], ["invited_id", 1]]
INSERT INTO "attendee_dinners" ("attendee_id", "dinner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["attendee_id", 2], ["dinner_id", 2], ["created_at", "2017-11-16 17:33:20.977870"], ["updated_at", "2017-11-16 17:33:20.977870"]]
DELETE FROM "invites" WHERE "invites"."id" = $1  [["id", 2]]

  def remove_attendee
    @attendee = Dinner.find(params[:id]).attendee_dinners.find_by(attendee_id: params[:user_id])
    @attendee.delete
---
SELECT  "attendee_dinners".* FROM "attendee_dinners" WHERE "attendee_dinners"."dinner_id" = $1 AND "attendee_dinners"."attendee_id" = $2 LIMIT $3  [["dinner_id", 4], ["attendee_id", 2], ["LIMIT", 1]]
DELETE FROM "attendee_dinners" WHERE "attendee_dinners"."id" = $1  [["id", 2]]

  def delete
    @dinner = Dinner.find(params[:id])
    @dinner.delete
---
SELECT  "dinners".* FROM "dinners" WHERE "dinners"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "dinners" WHERE "dinners"."id" = $1  [["id", 7]]