homecooked-rails/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "auth_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "daniel"], ["email", "drisdon07@gmail.com"], ["auth_token", "bmyNRkHwQh9r5TqiBso9MCrz"], ["created_at", "2017-11-14 19:28:28.085064"], ["updated_at", "2017-11-14 19:28:28.085064"]]
---
  def create
    @user = User.new(user_params)
    if @user.valid?
      @user.save()

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "dinners".* FROM "dinners" WHERE "dinners"."host_id" = $1  [["host_id", 2]]
---
  def index_user
    puts "user: #{User.find(params[:id]).json_hash[:id]}"
    hosted_dinners = []
    attended_dinners = []
    @user = User.find(params[:id])
    @hosted_dinners = @user.hosted_dinners.each do |dinner|