app/controllers/recipes_controller.rb

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    recipe = Recipe.find(params[:id]).parse_recipe

INSERT INTO "recipes" ("dinner_id", "name", "recipe_text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["dinner_id", 1], ["name", "\"CHICKEN\""], ["recipe_text", "\"cook the chicken\""], ["created_at", "2017-11-16 21:44:11.123236"], ["updated_at", "2017-11-16 21:44:11.123236"]]
---
  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.save

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "recipes" SET "name" = $1, "source" = $2, "ingredients" = $3, "updated_at" = $4 WHERE "recipes"."id" = $5  [["name", "Crisp Tacos Picadillo"], ["source", "Internet"], ["ingredients", "2 tsp Vegetable Oil (picadillo)"], ["updated_at", "2017-11-17 16:05:49.819298"], ["id", 1]]
---
  def update
    @recipe = Recipe.find(params[:id])
    @recipe.update(recipe_params)